# 1. Переменной var_int присвойте значение 10, var_float - значение 8.4, var_str - "No".
var_int = 10
print("var_int = ", var_int)
var_float = 8.4
print("var_float = ", var_float)
var_str = "No"
print("var_str = ", var_str)

# 2. Измените значение, хранимое в переменной var_int, увеличив его в 3.5 раза,
# результат свяжите с переменной big_int.
big_int = var_int * 3.5
print("big_int = var_int * 3.5 = ", big_int)

# 3. Измените значение, хранимое в переменной var_float, уменьшив его на единицу,
# результат свяжите с той же переменной.
var_float = var_float - 1
print("var_float = var_float - 1 = ", var_float)

# 4. Разделите var_int на var_float, а затем big_int на var_float. Результат данных
# выражений не привязывайте ни к каким переменным.
print ("var_int/var_float =", var_int / var_float)
print ("big_int/var_float =", big_int / var_float)

# 5. Измените значение переменной var_str на "NoNoYesYesYes". При формировании
# нового значения используйте операции конкатенации (+) и повторения строки (*).
var_str_yes = "Yes"
var_str_changed = var_str*2 + var_str_yes*3
print("var_str_changed = ", var_str_changed)

# 6. Выведите значения всех переменных.




